Repository: leeerrrrmmm/edTech
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

source: Text Title
ru: Заголовок текста
uk: Початок тексту

source: Goodbye
ru: Прощай
uk: Прощавай

source: Open Settings
ru: Открыть настройки
uk: Відкрити налаштування

source: Email
uk: Пошта

source: Name
uk: Ім`я

# pass
source: Password
uk: Пароль

source: About the course
ru: Про курс
uk: Про курс

# dart_description
source: Language for Flutter
ru: Язык для Flutter
uk: Мова для Flutter

# dart_about
source: You will learn about the Dart programming language, understand the basics and OOP, complete a couple of small projects, and after the course, you can move on to the Flutter course.
ru: Вы узнаете о языке программирования Dart, разберётесь в основах и ООП, выполните несколько небольших проектов и после завершения курса сможете приступить к изучению Flutter.
uk: Ви дізнаєтесь про мову програмування Dart, розберетесь в основах та ООП, виконаєте кілька невеликих проєктів, і після завершення курсу зможете перейти до вивчення Flutter.

# python_description
source: Popular programming language
ru: Популярный язык программирования
uk: Популярна мова програмування

# python_about
source: The course will include informative video lessons and quizzes on the Python programming language. You will be able to start your journey as a Python developer.
ru: Курс включает в себя познавательные видеоуроки и тесты по языку программирования Python. Вы сможете начать свой путь как разработчик на Python.
uk: Курс включає в себе пізнавальні відеоуроки та тести по мові програмування Python. Ви зможете розпочати свій шлях як Python-розробник.

# js_description
source: Language used for back-end web development
ru: Язык, используемый для back-end разработки сайтов
uk: Мова, що використовується для back-end розробки сайтів

# js_about
source: The course will include educational and fun lessons and quizzes. By the end, you will know where to go next. Buying the premium version unlocks advanced content and increases your chances of getting your first offer.
ru: Курс включает в себя обучающие и интересные уроки и тесты. По окончании курса вы будете понимать, куда двигаться дальше. При покупке премиум-версии получите доступ к продвинутому курсу и повысьте свои шансы получить первый оффер.
uk: Курс включає навчальні та цікаві уроки й тести. Після завершення ви знатимете, куди рухатись далі. Придбавши преміум-версію курсу, ви отримаєте розширений контент і більше шансів отримати перший оффер.

# flutter_description
source: Flutter enables developers to create beautiful, fast, and native apps for iOS, Android, Web, and Desktop.
ru: Flutter позволяет создавать красивые, быстрые и нативные приложения для iOS, Android, Web и Desktop.
uk: Flutter дозволяє створювати красиві, швидкі та нативні додатки для iOS, Android, Web та Desktop.

# flutter_about
source: A course from Google on Flutter, which interacts with Dart. You'll learn to build apps for mobile, Windows/Mac/Linux/Web, create projects like a TO-DO list, mini-shop, and an app that fetches movies/series via API.
ru: Курс от Google по Flutter, взаимодействующий с Dart. Вы научитесь создавать приложения под мобильные устройства, Windows/Mac/Linux/Web и реализуете проекты как TO-DO List, мини-магазин и приложение для просмотра фильмов/сериалов через API.
uk: Курс від Google по Flutter, що працює з Dart. Ви навчитесь створювати додатки для мобільних пристроїв, Windows/Mac/Linux/Web і реалізуєте такі проєкти як TO-DO List, міні-магазин і застосунок для перегляду фільмів/серіалів через API.

source: Duration
ru: Длительность курса
